#!/usr/bin/env python3
# encoding: utf-8
import numpy as np
import pandas as pd

'''
Pandas 选择数据
Ref: https://morvanzhou.github.io/tutorials/data-manipulation/np-pd/3-2-pd-indexing/
'''
dates = pd.date_range('20190101', periods=6)
df = pd.DataFrame(np.arange(24).reshape(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
print(df)
#              A   B   C   D
# 2019-01-01   0   1   2   3
# 2019-01-02   4   5   6   7
# 2019-01-03   8   9  10  11
# 2019-01-04  12  13  14  15
# 2019-01-05  16  17  18  19
# 2019-01-06  20  21  22  23

# 简单的筛选
print(df['A'])  # 同print(df.A)
# 2019-01-01     0
# 2019-01-02     4
# 2019-01-03     8
# 2019-01-04    12
# 2019-01-05    16
# 2019-01-06    20
# Freq: D, Name: A, dtype: int64

# 选择跨域多行或多列
print(df[0:3])
#             A  B   C   D
# 2019-01-01  0  1   2   3
# 2019-01-02  4  5   6   7
# 2019-01-03  8  9  10  11
print(df['2019-01-02':'2019-01-04'])  # 包含
#              A   B   C   D
# 2019-01-02   4   5   6   7
# 2019-01-03   8   9  10  11
# 2019-01-04  12  13  14  15

# 根据标签选择数据 loc
'''
同样我们可以使用标签来选择数据 loc, 
本例子主要通过标签名字选择某一行数据， 
或者通过选择某行或者所有行（:代表所有行）然后选其中某一列或几列数据。:
'''
print(df.loc['2019-01-02'])  # 选择一行数据
# A    4
# B    5
# C    6
# D    7
# Name: 2019-01-02 00:00:00, dtype: int64

print(df.loc[:, ['A', 'B']])
#              A   B
# 2019-01-01   0   1
# 2019-01-02   4   5
# 2019-01-03   8   9
# 2019-01-04  12  13
# 2019-01-05  16  17
# 2019-01-06  20  21

print(df.loc['20190102', ['A', 'B']])
# A    4
# B    5
# Name: 2019-01-02 00:00:00, dtype: int64


# 根据序列iloc
'''
另外我们可以采用位置进行选择 iloc, 
在这里我们可以通过位置选择在不同情况下所需要的数据例如选某一个，
连续选或者跨行选等操作。
'''
print(df.iloc[3, 1])  # 13

print(df.iloc[3:5, 1:3])
#              B   C
# 2019-01-04  13  14
# 2019-01-05  17  18

print(df.iloc[[1, 3, 5], 1:3])
#              B   C
# 2019-01-02   5   6
# 2019-01-04  13  14
# 2019-01-06  21  22

# 混合选择 ix ，已弃用
# 选择'A'、'C'的两列，并选择前三行的数据
# print(df.ix[:3, ['A', 'C']])

# 通过判断的筛选
print(df[df.A > 8])
#              A   B   C   D
# 2019-01-04  12  13  14  15
# 2019-01-05  16  17  18  19
# 2019-01-06  20  21  22  23




